## Import libraries

In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns', None)  # me muestre todas las columnas
#pd.set_option('display.max_rows', None)  # me muestre todas las filas

## Import files

In [2]:
sqltable_artists = pd.read_csv('../data/clean/api_artists_clean.csv', encoding='latin1')
sqltable_artists.head(2)

,artistidspotify,artistnamespotify,followers,popularity,genres
0,3WrFJ7ztbogyGnTHbHJFl2,The Beatles,26469550.0,82.0,"['beatlesque', 'british invasion', 'classic ro..."
1,3oDbviiivRWhXwIE8hxkVV,The Beach Boys,4308475.0,68.0,"['baroque pop', 'classic rock', 'folk rock', '..."

In [3]:
sqltable_artists.shape

(254, 5)

## Clean NAs and duplicates

In [4]:
sqltable_artists.dropna(inplace=True)

In [5]:
sqltable_artists.shape

(253, 5)

In [6]:
sqltable_artists.duplicated().any()

False

In [7]:
import re

for col in sqltable_artists.columns:
    sqltable_artists[col] = sqltable_artists[col].apply(lambda x: re.sub(r'[^\w\s]', '', x) if isinstance(x, str) else x)

sqltable_artists.head()

,artistidspotify,artistnamespotify,followers,popularity,genres
0,3WrFJ7ztbogyGnTHbHJFl2,The Beatles,26469550.0,82.0,beatlesque british invasion classic rock merse...
1,3oDbviiivRWhXwIE8hxkVV,The Beach Boys,4308475.0,68.0,baroque pop classic rock folk rock mellow gold...
2,74ASZWbe4lXaubB36ztrGX,Bob Dylan,6291947.0,68.0,classic rock country rock folk folk rock psych...
3,3koiLjNrgRTNbOwViDipeA,Marvin Gaye,5189557.0,71.0,classic soul motown neo soul northern soul qui...
4,22bE4uQ6baNwSHPVcDxLCe,The Rolling Stones,13455698.0,78.0,album rock british invasion classic rock rock

## Column names

In [8]:
sqltable_artists.columns

Index(['artistidspotify', 'artistnamespotify', 'followers', 'popularity',
       'genres'],
      dtype='object')

In [9]:
finalcolumns = ['sp_artistid', 'sp_artistname', 'sp_followers', 'sp_popularity', 'sp_genres']

In [10]:
sqltable_artists.columns = finalcolumns

In [11]:
sqltable_artists.head(1)

,sp_artistid,sp_artistname,sp_followers,sp_popularity,sp_genres
0,3WrFJ7ztbogyGnTHbHJFl2,The Beatles,26469550.0,82.0,beatlesque british invasion classic rock merse...

## Reoder columns

In [12]:
sqltable_artists = sqltable_artists.iloc[:, [0, 1, 2, 3]]
sqltable_artists.head(1)

              sp_artistid sp_artistname  sp_followers  sp_popularity
0  3WrFJ7ztbogyGnTHbHJFl2   The Beatles    26469550.0           82.0

## Data type

In [13]:
sqltable_artists.info()

<class 'pandas.core.frame.DataFrame'>
Index: 253 entries, 0 to 253
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sp_artistid    253 non-null    object
 1   sp_artistname  253 non-null    object
 2   sp_followers   253 non-null    float64
 3   sp_popularity  253 non-null    float64
dtypes: float64(2), object(2)
memory usage: 9.9+ KB

## Export

In [14]:
sqltable_artists.to_csv('../data/tableau/tableautable_artist.csv', index=False, encoding='latin1')